package step1_클래스와객체;

class Gift {
	String name;
	int price;
	
	Gift(String name, int price) {
		this.name=name;
		this.price=price;
	}
}


public class C7_Goods관리프로그램Ex {

	public static void main(String[] args) {
		
		//------------------------------------
		//1.제품수 | 2.제품내용등록 |3.제품리스트| 4.종료
		//------------------------------------
		//메뉴를 선태해주세요>>
		//1
		//등록할 제품수를 입력하시오>>
		//2
		//------------------------------------
		//1.제품수 | 2.제품내용등록 |3.제품리스트| 4.종료
		//------------------------------------
		//2
		//제품을 등록합니다.
		//제품명을 입력하시오>>
		//새우깡
		//제품가격을 입력하시오>>
		//1000
		//재고량을 입력하시오>>
		//21
		//판매량을 입력하시오>>
		//3
		//1번째 제품을 등록하였습니다.
		//계속 하시겠습니까?(y/n)
		
	}

}
